package cmd

import (
	"anvil/internal"
	"fmt"
	"strings"
)

func Help(...string) {
    fmt.Println(`
 █████╗ ███╗   ██╗██╗   ██╗██╗██╗     
██╔══██╗████╗  ██║██║   ██║██║██║     
███████║██╔██╗ ██║██║   ██║██║██║     
██╔══██║██║╚██╗██║╚██╗ ██╔╝██║██║     
██║  ██║██║ ╚████║ ╚████╔╝ ██║███████╗
╚═╝  ╚═╝╚═╝  ╚═══╝  ╚═══╝  ╚═╝╚══════╝

Instance + Mod Manager for FabricMC

Usage:
  anvil <command> [arguments]

Commands:`)

    for _, i := range internal.Commands {
        if len(i.Alias) > 0 {
            fmt.Printf("  anvil %s, %s\n    %s\n\n", i.Name, strings.Join(i.Alias, ", "), i.Description)
        } else {
            fmt.Printf("  anvil %s\n    %s\n\n", i.Name, i.Description)
        }
    }

}
